MikroElektronika/core_packages/ARM/gcc_clang/startup/toshiba/tmpm3hpfzafg.S
                adds     r4, #12
                b        .L_loop0
.L_loop0_done:

                ldr      r3, =__zero_table_start__
                ldr      r4, =__zero_table_end__

.L_loop2:
                cmp      r3, r4
                bge      .L_loop2_done
                ldr      r1, [r3]
                ldr      r2, [r3, #4]
                movs     r0, 0

.L_loop2_0:
                subs     r2, #4
                itt      ge
                strge    r0, [r1, r2]
                bge      .L_loop2_0

                adds     r3, #8
                b        .L_loop2
.L_loop2_done:

                bl       main

                .fnend
                .size    Reset_Handler, . - Reset_Handler

/* The default macro is not used for HardFault_Handler
 * because this results in a poor debug illusion.
 */
                .thumb_func
                .type    HardFault_Handler, %function
                .weak    HardFault_Handler
                .fnstart
HardFault_Handler:
                b        .
                .fnend
                .size    HardFault_Handler, . - HardFault_Handler

                .thumb_func
                .type    Default_Handler, %function
                .weak    Default_Handler
                .fnstart
Default_Handler:
                b        .
                .fnend
                .size    Default_Handler, . - Default_Handler

/* Macro to define default exception/interrupt handlers.
 * Default handler are weak symbols with an endless loop.
 * They can be overwritten by real handlers.
 */
                .macro   Set_Default_Handler  Handler_Name
                .weak    \Handler_Name
                .set     \Handler_Name, Default_Handler
                .endm


/* Default exception/interrupt handler */

                Set_Default_Handler  NMI_Handler
                Set_Default_Handler  MemManage_Handler
                Set_Default_Handler  BusFault_Handler
                Set_Default_Handler  UsageFault_Handler
                Set_Default_Handler  SVC_Handler
                Set_Default_Handler  DebugMon_Handler
                Set_Default_Handler  PendSV_Handler
                Set_Default_Handler  SysTick_Handler

                Set_Default_Handler  INT00_Handler
                Set_Default_Handler  INT01_Handler
                Set_Default_Handler  INT02_Handler
                Set_Default_Handler  INT03_Handler
                Set_Default_Handler  INT04_Handler
                Set_Default_Handler  INT05_Handler
                Set_Default_Handler  INT06_Handler
                Set_Default_Handler  INT07_Handler
                Set_Default_Handler  INT08_Handler
                Set_Default_Handler  INT09_Handler
                Set_Default_Handler  INT10_Handler
                Set_Default_Handler  INT11_Handler
                Set_Default_Handler  INT12_Handler
                Set_Default_Handler  INT13_Handler
                Set_Default_Handler  INT14_Handler
                Set_Default_Handler  INT15_Handler
                Set_Default_Handler  INT16_Handler
                Set_Default_Handler  INT17_18_32_33_Handler
                Set_Default_Handler  INT19_22_Handler
                Set_Default_Handler  INT23_26_Handler
                Set_Default_Handler  INT27_28_Handler
                Set_Default_Handler  Interrupt21_Handler
                Set_Default_Handler  Interrupt22_Handler
                Set_Default_Handler  INTEMG0_Handler
                Set_Default_Handler  INTOVV0_Handler
                Set_Default_Handler  INTPMD0_Handler
                Set_Default_Handler  INTENC00_Handler
                Set_Default_Handler  INTENC01_Handler
                Set_Default_Handler  INTADAPDA_Handler
                Set_Default_Handler  INTADAPDB_Handler
                Set_Default_Handler  INTADACP0_Handler
                Set_Default_Handler  INTADACP1_Handler
                Set_Default_Handler  INTADATRG_Handler
                Set_Default_Handler  INTADASGL_Handler
                Set_Default_Handler  INTADACNT_Handler
                Set_Default_Handler  INTT0RX_Handler
                Set_Default_Handler  INTT0TX_Handler
                Set_Default_Handler  INTT0ERR_Handler
                Set_Default_Handler  INTT1RX_Handler
                Set_Default_Handler  INTT1TX_Handler
                Set_Default_Handler  INTT1ERR_Handler
                Set_Default_Handler  INTT2RX_Handler
                Set_Default_Handler  INTT2TX_Handler
                Set_Default_Handler  INTT2ERR_Handler
                Set_Default_Handler  INTT3RX_Handler
                Set_Default_Handler  INTT3TX_Handler
                Set_Default_Handler  INTT3ERR_Handler
                Set_Default_Handler  INTT4RX_Handler
                Set_Default_Handler  INTT4TX_Handler
                Set_Default_Handler  INTT4ERR_Handler
                Set_Default_Handler  INTI2CWUP_Handler
                Set_Default_Handler  INTI2C0NST_Handler
                Set_Default_Handler  INTI2C0ATX_Handler
                Set_Default_Handler  INTI2C0BRX_Handler
                Set_Default_Handler  INTI2C0NA_Handler
                Set_Default_Handler  INTI2C1NST_Handler
                Set_Default_Handler  INTI2C1ATX_Handler
                Set_Default_Handler  INTI2C1BRX_Handler
                Set_Default_Handler  INTI2C1NA_Handler
                Set_Default_Handler  INTI2C2NST_Handler
                Set_Default_Handler  INTI2C2ATX_Handler
                Set_Default_Handler  INTI2C2BRX_Handler
                Set_Default_Handler  INTI2C2NA_Handler
                Set_Default_Handler  INTI2C3NST_Handler
                Set_Default_Handler  INTI2C3ATX_Handler
                Set_Default_Handler  INTI2C3BRX_Handler
                Set_Default_Handler  INTI2C3NA_Handler
                Set_Default_Handler  INTUART0RX_Handler
                Set_Default_Handler  INTUART0TX_Handler
                Set_Default_Handler  INTUART0ERR_Handler
                Set_Default_Handler  INTUART1RX_Handler
                Set_Default_Handler  INTUART1TX_Handler
                Set_Default_Handler  INTUART1ERR_Handler
                Set_Default_Handler  INTUART2RX_Handler
                Set_Default_Handler  INTUART2TX_Handler
                Set_Default_Handler  INTUART2ERR_Handler
                Set_Default_Handler  INTUART3RX_Handler
                Set_Default_Handler  INTUART3TX_Handler
                Set_Default_Handler  INTUART3ERR_Handler
                Set_Default_Handler  INTUART4RX_Handler
                Set_Default_Handler  INTUART4TX_Handler
                Set_Default_Handler  INTUART4ERR_Handler
                Set_Default_Handler  INTUART5RX_Handler
                Set_Default_Handler  INTUART5TX_Handler
                Set_Default_Handler  INTUART5ERR_Handler
                Set_Default_Handler  INTT32A00A_Handler
                Set_Default_Handler  INTT32A00ACAP0_Handler
                Set_Default_Handler  INTT32A00ACAP1_Handler
                Set_Default_Handler  INTT32A00B_Handler
                Set_Default_Handler  INTT32A00BCAP0_Handler
                Set_Default_Handler  INTT32A00BCAP1_Handler
                Set_Default_Handler  INTT32A00C_Handler
                Set_Default_Handler  INTT32A00CCAP0_Handler
                Set_Default_Handler  INTT32A00CCAP1_Handler
                Set_Default_Handler  INTT32A01A_Handler
                Set_Default_Handler  INTT32A01ACAP0_Handler
                Set_Default_Handler  INTT32A01ACAP1_Handler
                Set_Default_Handler  INTT32A01B_Handler
                Set_Default_Handler  INTT32A01BCAP0_Handler
                Set_Default_Handler  INTT32A01BCAP1_Handler
                Set_Default_Handler  INTT32A01C_Handler
                Set_Default_Handler  INTT32A01CCAP0_Handler
                Set_Default_Handler  INTT32A01CCAP1_Handler
                Set_Default_Handler  INTT32A02A_Handler
                Set_Default_Handler  INTT32A02ACAP0_Handler
                Set_Default_Handler  INTT32A02ACAP1_Handler
                Set_Default_Handler  INTT32A02B_Handler
                Set_Default_Handler  INTT32A02BCAP0_Handler
                Set_Default_Handler  INTT32A02BCAP1_Handler
                Set_Default_Handler  INTT32A02C_Handler
                Set_Default_Handler  INTT32A02CCAP0_Handler
                Set_Default_Handler  INTT32A02CCAP1_Handler
                Set_Default_Handler  INTT32A03A_Handler
                Set_Default_Handler  INTT32A03ACAP0_Handler
                Set_Default_Handler  INTT32A03ACAP1_Handler
                Set_Default_Handler  INTT32A03B_Handler
                Set_Default_Handler  INTT32A03BCAP0_Handler
                Set_Default_Handler  INTT32A03BCAP1_Handler
                Set_Default_Handler  INTT32A03C_Handler
                Set_Default_Handler  INTT32A03CCAP0_Handler
                Set_Default_Handler  INTT32A03CCAP1_Handler
                Set_Default_Handler  INTT32A04A_Handler
                Set_Default_Handler  INTT32A04ACAP0_Handler
                Set_Default_Handler  INTT32A04ACAP1_Handler
                Set_Default_Handler  INTT32A04B_Handler
                Set_Default_Handler  INTT32A04BCAP0_Handler
                Set_Default_Handler  INTT32A04BCAP1_Handler
                Set_Default_Handler  INTT32A04C_Handler
                Set_Default_Handler  INTT32A04CCAP0_Handler
                Set_Default_Handler  INTT32A04CCAP1_Handler
                Set_Default_Handler  INTT32A05A_Handler
                Set_Default_Handler  INTT32A05ACAP0_Handler
                Set_Default_Handler  INTT32A05ACAP1_Handler
                Set_Default_Handler  INTT32A05B_Handler
                Set_Default_Handler  INTT32A05BCAP0_Handler
                Set_Default_Handler  INTT32A05BCAP1_Handler
                Set_Default_Handler  INTT32A05C_Handler
                Set_Default_Handler  INTT32A05CCAP0_Handler
                Set_Default_Handler  INTT32A05CCAP1_Handler
                Set_Default_Handler  INTT32A06A_Handler
                Set_Default_Handler  INTT32A06ACAP0_Handler
                Set_Default_Handler  INTT32A06ACAP1_Handler
                Set_Default_Handler  INTT32A06B_Handler
                Set_Default_Handler  INTT32A06BCAP0_Handler
                Set_Default_Handler  INTT32A06BCAP1_Handler
                Set_Default_Handler  INTT32A06C_Handler
                Set_Default_Handler  INTT32A06CCAP0_Handler
                Set_Default_Handler  INTT32A06CCAP1_Handler
                Set_Default_Handler  INTT32A07A_Handler
                Set_Default_Handler  INTT32A07ACAP0_Handler
                Set_Default_Handler  INTT32A07ACAP1_Handler
                Set_Default_Handler  INTT32A07B_Handler
                Set_Default_Handler  INTT32A07BCAP0_Handler
                Set_Default_Handler  INTT32A07BCAP1_Handler
                Set_Default_Handler  INTT32A07C_Handler
                Set_Default_Handler  INTT32A07CCAP0_Handler
                Set_Default_Handler  INTT32A07CCAP1_Handler
                Set_Default_Handler  INTPARI_Handler
                Set_Default_Handler  INTDMAATC_Handler
                Set_Default_Handler  INTDMAAERR_Handler
                Set_Default_Handler  INTDMABTC_Handler
                Set_Default_Handler  INTDMABERR_Handler
                Set_Default_Handler  INTRTC_Handler
                Set_Default_Handler  INTRMC0_Handler
                Set_Default_Handler  INTFLCRDY_Handler
                Set_Default_Handler  INTFLDRDY_Handler
                Set_Default_Handler  INTLCDBUSF_Handler
                Set_Default_Handler  INTLCDSTOP_Handler
                Set_Default_Handler  INTUART6RX_Handler
                Set_Default_Handler  INTUART6TX_Handler
                Set_Default_Handler  INTUART6ERR_Handler
                Set_Default_Handler  INTUART7RX_Handler
                Set_Default_Handler  INTUART7TX_Handler
                Set_Default_Handler  INTUART7ERR_Handler


                .end